In [153]:
import pandas as pd

### Importing the Dataset

In [ ]:
%pip install kagglehub # installing kaggle hub if missing

Collecting kagglehub
  Downloading kagglehub-0.3.13-py3-none-any.whl.metadata (38 kB)
Requirement already satisfied: packaging in c:\users\khana\appdata\local\programs\python\python313\lib\site-packages (from kagglehub) (25.0)
Requirement already satisfied: pyyaml in c:\users\khana\appdata\local\programs\python\python313\lib\site-packages (from kagglehub) (6.0.3)
Requirement already satisfied: requests in c:\users\khana\appdata\local\programs\python\python313\lib\site-packages (from kagglehub) (2.32.5)
Collecting tqdm (from kagglehub)
  Downloading tqdm-4.67.1-py3-none-any.whl.metadata (57 kB)
Requirement already satisfied: charset_normalizer<4,>=2 in c:\users\khana\appdata\local\programs\python\python313\lib\site-packages (from requests->kagglehub) (3.4.3)
Requirement already satisfied: idna<4,>=2.5 in c:\users\khana\appdata\local\programs\python\python313\lib\site-packages (from requests->kagglehub) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\khana\appdata\local\programs\python\python313\lib\site-packages (from requests->kagglehub) (2.5.0)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\khana\appdata\local\programs\python\python313\lib\site-packages (from requests->kagglehub) (2025.10.5)
Requirement already satisfied: colorama in c:\users\khana\appdata\local\programs\python\python313\lib\site-packages (from tqdm->kagglehub) (0.4.6)
Downloading kagglehub-0.3.13-py3-none-any.whl (68 kB)
Downloading tqdm-4.67.1-py3-none-any.whl (78 kB)
Installing collected packages: tqdm, kagglehub

   ---------------------------------------- 0/2 [tqdm]
   ---------------------------------------- 0/2 [tqdm]
   ---------------------------------------- 0/2 [tqdm]
   ---------------------------------------- 0/2 [tqdm]
   ---------------------------------------- 0/2 [tqdm]
   ---------------------------------------- 0/2 [tqdm]
   ---------------------------------------- 0/2 [tqdm]
   ---------------------------------------- 0/2 [tqdm]
   ---------------------------------------- 0/2 [tqdm]
   -------------------- ------------------- 1/2 [kagglehub]
   -------------------- ------------------- 1/2 [kagglehub]
   -------------------- ------------------- 1/2 [kagglehub]
   -------------------- ------------------- 1/2 [kagglehub]
   -------------------- ------------------- 1/2 [kagglehub]
   -------------------- ------------------- 1/2 [kagglehub]
   -------------------- ------------------- 1/2 [kagglehub]
   ---------------------------------------- 2/2 [kagglehub]

Successfully installed kagglehub-0.3.13 tqdm-4.67.1

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

Use this if you don't have dataset on your local machine

In [ ]:

# import kagglehub
# import os
# # Download latest version
# path = kagglehub.dataset_download("zusmani/pakistans-largest-ecommerce-dataset")
# csv_path = os.path.join(path,'Pakistan Largest Ecommerce Dataset.csv')
# df = pd.read_csv(csv_path)

C:\Users\khana\.cache\kagglehub\datasets\zusmani\pakistans-largest-ecommerce-dataset\versions\2\Pakistan Largest Ecommerce Dataset.csv

C:\Users\khana\AppData\Local\Temp\ipykernel_10656\678891690.py:7: DtypeWarning: Columns (1,2,3,7,8,9,11,12,13,14,17,18,19) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(csv_path)

In [ ]:
# If you have dataset on your own macine in the same directory where this notebook is placed
df = pd.read_csv('Pakistan Largest Ecommerce Dataset.csv')

C:\Users\khana\AppData\Local\Temp\ipykernel_10656\3463096870.py:1: DtypeWarning: Columns (1,2,3,7,8,9,11,12,13,14,17,18,19) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('Pakistan Largest Ecommerce Dataset.csv')

### Understanding the data

In [155]:
df.head()

,item_id,status,created_at,sku,price,qty_ordered,grand_total,increment_id,category_name_1,sales_commission_code,...,Month,Customer Since,M-Y,FY,Customer ID,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25
0,211131.0,complete,7/1/2016,kreations_YI 06-L,1950.0,1.0,1950.0,100147443,Women's Fashion,\N,...,7.0,2016-7,7-2016,FY17,1.0,NaN,NaN,NaN,NaN,NaN
1,211133.0,canceled,7/1/2016,kcc_Buy 2 Frey Air Freshener & Get 1 Kasual Bo...,240.0,1.0,240.0,100147444,Beauty & Grooming,\N,...,7.0,2016-7,7-2016,FY17,2.0,NaN,NaN,NaN,NaN,NaN
2,211134.0,canceled,7/1/2016,Ego_UP0017-999-MR0,2450.0,1.0,2450.0,100147445,Women's Fashion,\N,...,7.0,2016-7,7-2016,FY17,3.0,NaN,NaN,NaN,NaN,NaN
3,211135.0,complete,7/1/2016,kcc_krone deal,360.0,1.0,60.0,100147446,Beauty & Grooming,R-FSD-52352,...,7.0,2016-7,7-2016,FY17,4.0,NaN,NaN,NaN,NaN,NaN
4,211136.0,order_refunded,7/1/2016,BK7010400AG,555.0,2.0,1110.0,100147447,Soghaat,\N,...,7.0,2016-7,7-2016,FY17,5.0,NaN,NaN,NaN,NaN,NaN

In [156]:
df.shape

(1048575, 26)

In [157]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 26 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   item_id                584524 non-null  float64
 1   status                 584509 non-null  object
 2   created_at             584524 non-null  object
 3   sku                    584504 non-null  object
 4   price                  584524 non-null  float64
 5   qty_ordered            584524 non-null  float64
 6   grand_total            584524 non-null  float64
 7   increment_id           584524 non-null  object
 8   category_name_1        584360 non-null  object
 9   sales_commission_code  447346 non-null  object
 10  discount_amount        584524 non-null  float64
 11  payment_method         584524 non-null  object
 12  Working Date           584524 non-null  object
 13  BI Status              584524 non-null  object
 14   MV                    584524 non-null  object
 15  Year                   584524 non-null  float64
 16  Month                  584524 non-null  float64
 17  Customer Since         584513 non-null  object
 18  M-Y                    584524 non-null  object
 19  FY                     584524 non-null  object
 20  Customer ID            584513 non-null  float64
 21  Unnamed: 21            0 non-null       float64
 22  Unnamed: 22            0 non-null       float64
 23  Unnamed: 23            0 non-null       float64
 24  Unnamed: 24            0 non-null       float64
 25  Unnamed: 25            0 non-null       float64
dtypes: float64(13), object(13)
memory usage: 208.0+ MB

### Data Cleaning and Wrangling

#### Removing the Unnamed Columns
##### They have 0 non-null values so they contribute nothing to our knowledge

In [158]:
df.drop(['Unnamed: 21','Unnamed: 22','Unnamed: 23','Unnamed: 24','Unnamed: 25'],axis = 1,inplace = True)

In [159]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 21 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   item_id                584524 non-null  float64
 1   status                 584509 non-null  object
 2   created_at             584524 non-null  object
 3   sku                    584504 non-null  object
 4   price                  584524 non-null  float64
 5   qty_ordered            584524 non-null  float64
 6   grand_total            584524 non-null  float64
 7   increment_id           584524 non-null  object
 8   category_name_1        584360 non-null  object
 9   sales_commission_code  447346 non-null  object
 10  discount_amount        584524 non-null  float64
 11  payment_method         584524 non-null  object
 12  Working Date           584524 non-null  object
 13  BI Status              584524 non-null  object
 14   MV                    584524 non-null  object
 15  Year                   584524 non-null  float64
 16  Month                  584524 non-null  float64
 17  Customer Since         584513 non-null  object
 18  M-Y                    584524 non-null  object
 19  FY                     584524 non-null  object
 20  Customer ID            584513 non-null  float64
dtypes: float64(8), object(13)
memory usage: 168.0+ MB

#### Removing the ID's Columns
As they add nothing to our Analytical knowledge

In [160]:
df.drop(['item_id','increment_id','Customer ID'],axis = 1,inplace = True)

In [161]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 18 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   status                 584509 non-null  object
 1   created_at             584524 non-null  object
 2   sku                    584504 non-null  object
 3   price                  584524 non-null  float64
 4   qty_ordered            584524 non-null  float64
 5   grand_total            584524 non-null  float64
 6   category_name_1        584360 non-null  object
 7   sales_commission_code  447346 non-null  object
 8   discount_amount        584524 non-null  float64
 9   payment_method         584524 non-null  object
 10  Working Date           584524 non-null  object
 11  BI Status              584524 non-null  object
 12   MV                    584524 non-null  object
 13  Year                   584524 non-null  float64
 14  Month                  584524 non-null  float64
 15  Customer Since         584513 non-null  object
 16  M-Y                    584524 non-null  object
 17  FY                     584524 non-null  object
dtypes: float64(6), object(12)
memory usage: 144.0+ MB

In [162]:
df['Month'].unique()

array([ 7.,  8.,  9., 10., 11., 12.,  1.,  2.,  3.,  4.,  5.,  6., nan])

In [163]:
df['Year'].unique()

array([2016., 2017., 2018.,   nan])

In [164]:
df['M-Y'].unique()

array(['7-2016', '8-2016', '9-2016', '10-2016', '11-2016', '12-2016',
       '1-2017', '2-2017', '3-2017', '4-2017', '5-2017', '6-2017',
       '7-2017', '8-2017', '9-2017', '10-2017', '11-2017', '12-2017',
       '2-2018', '1-2018', '3-2018', '4-2018', '5-2018', '6-2018',
       '7-2018', '8-2018', nan], dtype=object)

#### Dropping the M-Y column as it redundant
It is just a composition of Month and year of order

In [165]:
df.drop(['M-Y'],axis = 1,inplace = True)

#### Dropping the Month and Year as they can be inferred from the created_at date

In [166]:
df.drop(['Month'],axis = 1,inplace = True)
df.drop(['Year'],axis = 1,inplace = True)

#### Dropping the working date colum as it is same as created_at which makes it redundant

In [167]:
df.drop(['Working Date'],axis = 1,inplace = True)

In [168]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 14 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   status                 584509 non-null  object
 1   created_at             584524 non-null  object
 2   sku                    584504 non-null  object
 3   price                  584524 non-null  float64
 4   qty_ordered            584524 non-null  float64
 5   grand_total            584524 non-null  float64
 6   category_name_1        584360 non-null  object
 7   sales_commission_code  447346 non-null  object
 8   discount_amount        584524 non-null  float64
 9   payment_method         584524 non-null  object
 10  BI Status              584524 non-null  object
 11   MV                    584524 non-null  object
 12  Customer Since         584513 non-null  object
 13  FY                     584524 non-null  object
dtypes: float64(4), object(10)
memory usage: 112.0+ MB

### Setting DataTypes according to the data in the fields
This will also help us in optimizing space usage per row

Firstly using snake case for all the column names

In [169]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')

In [170]:
df['status'] = df['status'].astype('category') # Converting order status datatype to category
df['bi_status'] = df['bi_status'].astype('category')
# MV column contains , to convert it into integer we first have to remove the ,
df['mv'] = df['mv'].str.strip().str.replace(',', '')
df['mv'] = pd.to_numeric(df['mv'], errors='coerce')
df['created_at'] = pd.to_datetime(df['created_at'])
# quantity con't be 2.5 or 3.5 it would be an integer ## integer takes less space then float
df['qty_ordered'] = df['qty_ordered'].astype('Int32')

In [171]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 14 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   status                 584509 non-null  category
 1   created_at             584524 non-null  datetime64[ns]
 2   sku                    584504 non-null  object
 3   price                  584524 non-null  float64
 4   qty_ordered            584524 non-null  Int32
 5   grand_total            584524 non-null  float64
 6   category_name_1        584360 non-null  object
 7   sales_commission_code  447346 non-null  object
 8   discount_amount        584524 non-null  float64
 9   payment_method         584524 non-null  object
 10  bi_status              584524 non-null  category
 11  mv                     582292 non-null  float64
 12  customer_since         584513 non-null  object
 13  fy                     584524 non-null  object
dtypes: Int32(1), category(2), datetime64[ns](1), float64(4), object(6)
memory usage: 95.0+ MB

#### Removing the Duplicated Rows

In [172]:
df.duplicated().sum()

np.int64(573761)

In [173]:
df = df.drop_duplicates()

In [174]:
df.duplicated().sum()

np.int64(0)

In [175]:
df.shape

(474814, 14)

### Catering with the null values

In [176]:
df.isnull().sum()

status                       16
created_at                    1
sku                          18
price                         1
qty_ordered                   1
grand_total                   1
category_name_1              63
sales_commission_code    108599
discount_amount               1
payment_method                1
bi_status                     1
mv                         1701
customer_since               12
fy                            1
dtype: int64

In [177]:
# Percentage of Null values across all the columns
df.isnull().sum()/df.shape[0]*100

status                    0.003370
created_at                0.000211
sku                       0.003791
price                     0.000211
qty_ordered               0.000211
grand_total               0.000211
category_name_1           0.013268
sales_commission_code    22.871904
discount_amount           0.000211
payment_method            0.000211
bi_status                 0.000211
mv                        0.358246
customer_since            0.002527
fy                        0.000211
dtype: float64

In [178]:
df[df['price'].isnull()]

,status,created_at,sku,price,qty_ordered,grand_total,category_name_1,sales_commission_code,discount_amount,payment_method,bi_status,mv,customer_since,fy
584524,NaN,NaT,NaN,NaN,<NA>,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [179]:
df = df[~df['price'].isnull()] # removing the row where price is null

In [180]:
df.isnull().sum()

status                       15
created_at                    0
sku                          17
price                         0
qty_ordered                   0
grand_total                   0
category_name_1              62
sales_commission_code    108598
discount_amount               0
payment_method                0
bi_status                     0
mv                         1700
customer_since               11
fy                            0
dtype: int64

#### Dealing with remainng Null values

In [181]:
df.describe()

,created_at,price,qty_ordered,grand_total,discount_amount,mv
count,474813,4.748130e+05,474813.0,4.748130e+05,474813.000000,4.731130e+05
mean,2017-08-06 09:40:32.913167360,5.345931e+03,1.256684,7.762724e+03,387.671124,6.068247e+03
min,2016-07-01 00:00:00,0.000000e+00,1.0,-1.594000e+03,-599.500000,0.000000e+00
25%,2017-02-12 00:00:00,3.450000e+02,1.0,9.440000e+02,0.000000,3.750000e+02
50%,2017-08-13 00:00:00,7.990000e+02,1.0,1.762200e+03,0.000000,8.990000e+02
75%,2018-01-12 00:00:00,2.500000e+03,1.0,5.269000e+03,91.760000,2.925000e+03
max,2018-08-28 00:00:00,1.012626e+06,1000.0,1.788800e+07,90300.000000,8.944000e+06
std,NaN,1.392565e+04,4.240686,6.714445e+04,1354.749150,3.618903e+04